<script setup>
const data = [
  {
    id: 1,
    num: "01",
    title: "Клиентоориентированность",
    description:
      "Все это время «Стройград» стремительно развивался, выходил на новые рынки, наращивал собственную производственную базу, осваивал новые направления бизнеса.",
    image: "",
  },
  {
    id: 2,
    num: "02",
    title: "Честность и ответсвенность",
    description:
      "Все это время «Стройград» стремительно развивался, выходил на новые рынки, наращивал собственную производственную базу, осваивал новые направления бизнеса.",
    image: "",
  },
  {
    id: 3,
    num: "03",
    title: "Лидерство и инновации",
    description:
      "Все это время «Стройград» стремительно развивался, выходил на новые рынки, наращивал собственную производственную базу, осваивал новые направления бизнеса.",
    image: "",
  },
  {
    id: 4,
    num: "04",
    title: "Вовлеченность и инициатива",
    description:
      "Все это время «Стройград» стремительно развивался, выходил на новые рынки, наращивал собственную производственную базу, осваивал новые направления бизнеса.",
    image: "",
  },
];
</script>

<template>
  <section>
    <div class="container">
      <div class="grid grid-cols-[280rem_980rem] gap-[280rem]">
        <div class="left">
          <UiSpanTitle>Преимущества компании</UiSpanTitle>
        </div>

        <div class="flex flex-col">
          <UiText size="md"
            >Какой-то текст, который сможет донести то аудитории, что мы
            надежный застройщик и что наши комплексы отвечают всем самым высоким
            требованиям жильцов.
          </UiText>

          <p class="w-[560rem] mt-[70rem] text-grayText">
            Продолжаем убеждать в том, что лучше нас не найти. Аргументы с
            которыми просто не поспоришь. Еще пару строк и клиенты сами начнут
            ломиться в офис.
          </p>
        </div>
      </div>
    </div>

    <div class="mt-[70rem] flex flex-col">
      <div class="border-b border-grayLight" v-for="item in data">
        <div class="container">
          <div class="grid grid-cols-[560rem_980rem_140rem] py-[40rem]">
            <div class="text-[14rem] leading-[100%]">{{ item.num }}</div>
            <div class="text-[40rem] leading-[100%]">{{ item.title }}</div>
            <div class="">+</div>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>
